🧜‍♀️ improve docs
